app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
SELECT "posts".* FROM "posts" ORDER BY created_at
---
  def index
    id = current_user.id.to_i
    @posts = Post.where(user_id:id)
    @allposts = Post.all.order("created_at").reverse

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello Worl"], ["body", "Hi"], ["user_id", 4], ["created_at", "2018-07-08 14:56:26.717895"], ["updated_at", "2018-07-08 14:56:26.717895"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "What is today?"], ["body", "Sunday,\r\nFunday\r\nBBQ"], ["updated_at", "2018-07-08 15:17:00.671802"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)